<?php

namespace Database\Seeders;

use App\Models\Club;
use App\Models\PriceCategory;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PriceCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'name' => 'Тренажерный зал',
                'color' => '#3F4294',
                'comment' => '* Цена действительна при предъявлении Школьного билета. Неделя заморозки.',
                'price' => [
                    [
                        'name' => 'Абонемент на месяц 8.00 — 17.00',
                        'price' => '380'
                    ],
                    [
                        'name' => 'Абонемент на месяц 8.00 — 22.00',
                        'price' => '480'
                    ],
                    [
                        'name' => 'Абонемент на месяц 8.00 — 22.00 + кроссфит зона',
                        'price' => '530'
                    ],
                    [
                        'name' => 'Абонемент на 3 месяца',
                        'price' => '1259'
                    ],
                    [
                        'name' => 'Абонемент на 6 месяцев',
                        'price' => '2259'
                    ],
                    [
                        'name' => 'Годовой абонемент',
                        'price' => '3399'
                    ],
                    [
                        'name' => 'Единоразовый абонемент',
                        'price' => '100'
                    ],
                ]
            ],
            [
                'name' => 'Разовые услуги',
                'color' => '#3F4294',
                'price' => [
                    [
                        'name' => 'Тренировка с тренером',
                        'price' => 100
                    ],
                ]
            ],
            [
                'name' => 'Специальная цена для школьников *',
                'color' => '#3F4294',
                'comment' => '* Цена действительна при предъявлении Школьного билета. Неделя заморозки.',
                'price' => [
                    [
                        'name' => 'Абонемент на месяц 8.00 — 17.00',
                        'price' => 100
                    ],
                ]
            ],
            [
                'name' => 'Абонемент с тренером',
                'color' => '#3F4294',
                'actia' => true,
                'price' => [
                    [
                        'name' => 'Безлимитный абонемент в тренажерный зал + тренер 1299 грн',
                        'price' => 100,
                        'comment' => '8 тренировок с тренером Заморозка до 7 дней'
                    ],
                    [
                        'name' => 'Безлимитный абонемент в тренажерный зал + тренер 1699 грн',
                        'price' => 100,
                        'comment' => '12 тренировок с тренером Заморозка до 7 дней'
                    ],
                ]
            ],
            [
                'name' => 'Семейный абонемент в тренажерный зал (1 или 2 взрослых + ребенок)',
                'color' => '#3F4294',
                'actia' => true,
                'comment' => '*  Цена действительна при предъявлении паспорта и свидетельства о рождении.',
                'price' => [
                    [
                        'name' => 'Абонемент на месяц (2 человека) 8.00 — 16.00',
                        'price' => '680'
                    ],
                    [
                        'name' => 'Абонемент на месяц (2 человека) 8.00 — 22.00',
                        'price' => '850'
                    ],
                    [
                        'name' => 'Абонемент на месяц (3 человека) 8.00 — 16.00',
                        'price' => '1000'
                    ],
                    [
                        'name' => 'Абонемент на месяц (3 человека) 8.00 — 22.00',
                        'price' => '1300'
                    ],
                ]
            ],
            [
                'name' => 'Фитнес, пилатес, танцевальная аэробика, фитнес-микс',
                'color' => '#3F4294',
                'actia' => true,
                'comment' => '*  Абонементы на групповые занятия не замораживаются',
                'price' => [
                    [
                        'name' => '8 тренировок в месяц',
                        'price' => '480',
                        'month' => true
                    ],
                    [
                        'name' => '12 тренировок в месяц',
                        'price' => '480',
                        'month' => true
                    ],
                    [
                        'name' => 'Групповые 12 тренировок в месяц + безлимит в зал',
                        'price' => '480',
                        'month' => true
                    ],
                    [
                        'name' => 'Разовая тренировка',
                        'price' => '480',
                    ],
                ]
            ],
            [
                'name' => 'Джиу-Джитсу, Грепплинг, MMA (дети 6-15 лет)',
                'color' => '#3F4294',
                'actia' => true,
                'comment' => '*  Абонементы на групповые занятия не замораживаются',
                'price' => [
                    [
                        'name' => 'Одно занятие',
                        'price' => '480',
                    ],
                    [
                        'name' => 'Абонемент на месяц (три занятия в неделю) Взрослые',
                        'price' => '480',
                        'month' => true
                    ],
                    [
                        'name' => 'Абонемент на месяц (три занятия в неделю) Дети 6-15 лет',
                        'price' => '480',
                        'month' => true
                    ]
                ]
            ],
        ];

        foreach ($data as $datum) {

            $price_category = PriceCategory::create(\Arr::except($datum , 'price'));

            foreach ($datum['price'] as $item) {
                $price_category->price()->create($item);
            }

//            $price_category->clubs()->attach(Club::all()->pluck('id')->toArray());
        }
    }
}
